benchmark/old_outputs/single_thread/clock_new/zipf_64/2026-04-17T18:19:45-04:00_1_9_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1343159
number of failed transactions: 0 (0.000%)
latency average = 0.268 ms
initial connection time = 2.894 ms
tps = 7462.105464 (without initial connection time)
SQL script 1: pgscripts/zipfian_select.sql
 - weight: 1 (targets 10.0% of total)
 - 134122 transactions (10.0% of total)
 - number of transactions actually processed: 134122 (tps = 745.133308)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.085 ms
 - latency stddev = 0.015 ms
SQL script 2: pgscripts/zipfian_update.sql
 - weight: 9 (targets 90.0% of total)
 - 1209037 transactions (90.0% of total)
 - number of transactions actually processed: 1209037 (tps = 6716.972156)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.288 ms
 - latency stddev = 0.103 ms
ratio: .9993054204599887